import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        int a = 20;
        Scanner in = new Scanner(System.in);
        int s = in.nextInt();
        int m;
         System.out.println(m=s/a);


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}