import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        int cost = 1500;
        int miles;
        System.out.println(miles = cost / 20);


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
